
# Main oscillator
#create_clock -period 10.000 -name sys_clk_pin -waveform {0.000 5.000} [get_ports i_clk]


# Clocks "main" and "sclk_adc" are generated by the Vivado clocking wizard
set adc_sclk sclk_adc 
set main_clk main_clk
create_generated_clock -name $adc_sclk [get_pins u_clk/inst/mmcm_adv_inst/CLKOUT0]
create_generated_clock -name $main_clk [get_pins u_clk/inst/mmcm_adv_inst/CLKOUT1]

# VCLK for ADC
#set adc_vclk_per [expr 1000 / 22.9]
#set adc_vclk_per_half [expr $adc_vclk_per / 2]

#create_clock -name adc_vclk -period $adc_vclk_per

# ADC timing 
#set_input_delay -max 2 -clock adc_vclk [get_ports i_adc_eoc]
#set_input_delay -min 1 -clock adc_vclk [get_ports i_adc_eoc]
#set_max_delay -datapath_only -from [get_ports i_adc_eoc] -to [get_cells ]
#set_output_delay -max $adc_vclk_per_half -clock adc_vclk [get_ports o_adc_stconv]

# ADC SPI timing
set_output_delay -clock_fall -clock $adc_sclk -max 8 [get_ports o_spi_main_mosi]
set_output_delay -clock_fall -clock $adc_sclk -min -4 [get_ports o_spi_main_mosi]
set_input_delay -clock $adc_sclk -max 10 [get_ports i_spi_main_miso]
set_input_delay -clock $adc_sclk -min 2 [get_ports i_spi_main_miso]
set_output_delay -clock_fall -clock $adc_sclk -fall -max 5 [get_ports o_spi_main_cs_n]

set_multicycle_path 3 -setup -start -from $main_clk -to $adc_sclk -through [get_ports o_spi_main_mosi]
set_multicycle_path 2 -hold -from $main_clk -to $adc_sclk -through [get_ports o_spi_main_mosi]
set_multicycle_path 3 -setup -from $adc_sclk -to $main_clk -through [get_ports i_spi_main_miso]
set_multicycle_path 2 -hold -end -from $adc_sclk -to $main_clk -through [get_ports i_spi_main_miso]

set_multicycle_path 3 -setup -start -from $main_clk -to $adc_sclk -through [get_ports o_spi_main_cs_n]
set_multicycle_path 2 -hold -from $main_clk -to $adc_sclk -through [get_ports o_spi_main_cs_n]

#set_false_path -from $main_clk -to $adc_sclk
